{"nodes":[{"node":{"title":"Cold Weather blowing in – Update: Friday 30 January; 6.30am","Body":"<h3 class=\"heading-medium\">Weather Forecast</h3>\n<p>Last night was very quiet with no snow. Some bands of sleet passed across the area but caused&nbsp;no problems. The Met Office forecast indicates that&nbsp;the wintery weather will continue, however today (Friday) conditions will generally dry out.&nbsp;&nbsp;Temperatures remain low so drivers should take care.</p>\n<h3 class=\"heading-medium\">Gritting</h3>\n<p>The gritting team completed a full gritting run yesterday afternoon and are on call in the unlikely event that conditions will change.</p>\n<p>Based on the current Met Office forecast we don’t expect the weather to cause any problems and we expect all roads and schools to continue to be open and operating normally. The Council’s salt barn was fully restocked last week and our gritting operations from yesterday have ensured there is good bed of salt on our roads. We will be monitoring the conditions and carrying out further inspections</p>\n<h3 class=\"heading-medium\">Waste Collection Preparations</h3>\n<p>We anticipate that household waste will be collected normally. Households are being asked to put their waste out on their scheduled collection day.</p>\n<h3 class=\"heading-medium\">Schools</h3>\n<p>All schools are expected to be open and operating normally. For the latest information on local schools please go to&nbsp; <a href=\"http://www.bathnes.gov.uk/school-closures\"><span style=\"text-decoration: underline;\"><span style=\"color: #0000ff;\" color=\"#0000ff\">www.bathnes.gov.uk/school-closures</span></span></a>.</p>\n<h3 class=\"heading-medium\">Highways Preparations</h3>\n<p>The Highways team will have inspectors out on the roads to monitor conditions. The timing of any further gritting runs will be dependent on prevailing conditions to maximise the effectiveness of the gritting process.</p>\n<p><strong></p>\n<iframe width=\"400\" height=\"225\" style=\"margin-left: 15px; float: right;\" src=\"https://www.youtube.com/embed/gs3PWiQ-6tY\" frameborder=\"0\" allowfullscreen=\"\"></iframe><p></strong></p>\n<h3>Car parks</h3>\n<p>All car parks are expected to be open.</p>\n<h3 class=\"heading-medium\">Other Council Services</h3>\n<p>All other Council services are anticipated to be open and operating normally. The Council’s website will be updated regularly to keep residents up to date about general information: <a href=\"http://www.bathnes.gov.uk/\"><span style=\"text-decoration: underline;\"><span style=\"color: #0000ff;\" color=\"#0000ff\">www.bathnes.gov.uk</span></span></a> .</p>\n<p>Any problems should reported either via the online form <a href=\"http://www.bathnes.gov.uk/reportit\"><span style=\"text-decoration: underline;\"><span style=\"color: #0000ff;\" color=\"#0000ff\">www.bathnes.gov.uk/reportit</span></span></a> or to Council Connect on 01225 394041.</p>\n<h3 class=\"heading-medium\">Winter driving tips</h3>\n<p>The Council has put together some useful <a href=\"http://www.bathnes.gov.uk/services/parking-and-travel/mot-testing/winter-driving-tips\"><span style=\"text-decoration: underline;\"><span style=\"color: #0000ff;\" color=\"#0000ff\">winter driving hints and tips</span></span></a> to help you ensure your journey is safe in snow/icy conditions.</p>\n"}}]}